project-chip/connectedhomeip/examples/platform/nxp/rt/rt1060/board/evkcmimxrt1060/pin_mux.c
    /* GPIO configuration on GPIO_AD_B1_00 (pin J11) */
    gpio_pin_config_t gpio1_pinJ11_config = { .direction     = kGPIO_DigitalInput,
                                              .outputLogic   = 0U,
                                              .interruptMode = kGPIO_NoIntmode };
    /* Initialize GPIO functionality on GPIO_AD_B1_00 (pin J11) */
    GPIO_PinInit(GPIO1, 16U, &gpio1_pinJ11_config);

    /* GPIO configuration on GPIO_AD_B1_01 (pin K11) */
    gpio_pin_config_t gpio1_pinK11_config = { .direction     = kGPIO_DigitalInput,
                                              .outputLogic   = 0U,
                                              .interruptMode = kGPIO_NoIntmode };
    /* Initialize GPIO functionality on GPIO_AD_B1_01 (pin K11) */
    GPIO_PinInit(GPIO1, 17U, &gpio1_pinK11_config);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0U);
    IOMUXC_GPR->GPR26 = ((IOMUXC_GPR->GPR26 & (~(BOARD_DEINITM2I2CPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK))) |
                         IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL(0x00U));
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0x10B0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0x10B0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
